/* 5.1 Для однієї з таблиць, що містить обмеження цілісності зовнішнього ключа, виконати
команду зміни значення колонки зовнішнього ключа на значення, яке відсутнє в колонці
первинного ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.
*/

UPDATE Gym
SET locNo = 3
WHERE 
    gymNo = 1;

/* Результат:

Error starting at line : 1 in command -
UPDATE Gym
SET locNo = 3
WHERE 
    gymNo = 1
Error report -
ORA-02291: нарушено ограничение целостности (SYSTEM.GYM_LOCNO_FK) - исходный ключ не найден
*/

/ *5.2 Повторити рішення завдання 5.1, але таке, що не призводить до порушення цілісності
зовнішнього ключа.
*/

UPDATE Gym
SET locNo = 1
WHERE 
    gymNo = 4;

/* Результат:

1 row updated.
*/

/* 5.3 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, пов'язане з
колонкою зовнішнього ключа іншої таблиці, виконати одну команду видалення рядка зі значенням
колонки первинного ключа, що є в колонці зовнішнього ключа іншої таблиці. Перевірити реакцію
СКБД видалення.
*/

DELETE FROM Gym
WHERE
    gymNo = 2;

/* Результат:

Error starting at line : 1 in command -
DELETE FROM Gym
WHERE
    gymNo = 2
Error report -
ORA-02292: нарушено ограничение целостности (SYSTEM.CLEANER_GYMNO_FK) - обнаружена порожденная запись
*/

/* 5.4 Повторити рішення завдання 5.3, але таке, що не призводить до порушення цілісності
зовнішнього ключа.
*/

DELETE FROM Coach
WHERE
    gymNo = 2;

/* Результат:

1 row deleted.
*/

/* 5.5 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, виконати
команду зміни значення колонки первинного ключа на значення, яке присутнє у колонці
зовнішнього ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.
*/

UPDATE Loc
SET locNo = 1
WHERE 
    locNo = 2;

/* Результат:

Error starting at line : 1 in command -
UPDATE Loc
SET locNo = 1
WHERE 
    locNo = 2
Error report -
ORA-00001: нарушено ограничение уникальности (SYSTEM.LOC_PK)
*/

/* 5.6 Повторити рішення завдання 5.5, але таке, що не призводить до порушення цілісності
зовнішнього ключа, тобто виконати команду зміни значення колонки первинного ключа на
значення, яке вже не присутнє у колонці зовнішнього ключа відповідної таблиці.
*/

UPDATE Loc
SET locNo = 1
WHERE 
    locNo = 3;

/* Результат:

0 rows updated.
*/