/* 6.1 Для однієї з таблиць створити команду отримання кількості рядків таблиці.
*/

SELECT 
    COUNT(gymNo)
FROM gym;

/* Результат:

COUNT(GYMNO)
------------
           4
*/

/* 6.2 Для однієї з таблиць створити команду отримання суми значень однієї з цілих
колонок.
*/

SELECT 
    SUM(sportsEquipment)
FROM gym;

/* Результат:

SUM(SPORTSEQUIPMENT)
--------------------
                 277
*/

/* 6.3 Для однієї з таблиць створити команду отримання статистики появи значень однієї з
колонок у таблиці, наприклад:
- значення 1, кількість появи значення 1
- значення 2, кількість появи значення 2
*/

SELECT
    gymNo,
    COUNT(gymNo)
FROM gym
GROUP BY gymNo;

/* Результат:

     GYMNO COUNT(GYMNO)
---------- ------------
         1            1
         2            1
         3            1
         4            1
*/

/* 6.4 Модифікувати рішення попереднього завдання так, щоб у відповіді були
відфільтровані рядки з урахуванням заданої умови, що включає використану функцію агрегації.
*/

SELECT
    gymNo,
    COUNT(gymNo)
FROM gym
GROUP BY gymNo
ORDER BY COUNT(gymNo) ASC;

/* Результат:

     GYMNO COUNT(GYMNO)
---------- ------------
         1            1
         2            1
         3            1
         4            1
*/
