/* 1.1. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає усереднені значення другої колонки кожного рядка в кожній підгрупі.
Використати аналітичну функцію на основі AVG, PARTITION BY.

Отримати ім'я тренера, зал у якому він працює, дату прийому на роботу з 
одночасним показом середньої зарплати тренерів у тренажерних залах.
*/

SELECT cName, gymNo, hireDate,
    AVG(sal) OVER (PARTITION BY gymNo) avg_sal
FROM COACH;

/* Результат:

CNAME           GYMNO HIREDATE    AVG_SAL
---------- ---------- -------- ----------
Alexander           1 04.07.15       8500
Ivan                1 03.04.19       8500
Andrey              5 07.04.17       7750
Philip              5 20.05.18       7750
Antoniy             6 27.09.18       7500
Olesya              6 11.11.18       7500

6 rows selected.
*/



/* 1.2. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає накопичувальні підсумки другої колонки.
Використати аналітичну функцію на основі AVG, ORDER BY.

Для кожного рядка визначити середні витрати спортклубу на зарплату тренерів на вказану дату.
*/

SELECT cName, gymNo, hireDate, sal,
    AVG(sal) OVER (ORDER BY hireDate) avg_sal
FROM COACH;

/* Результат:

CNAME           GYMNO HIREDATE        SAL    AVG_SAL
---------- ---------- -------- ---------- ----------
Alexander           1 04.07.15       9000       9000
Andrey              5 07.04.17       8000       8500
Philip              5 20.05.18       7500 8166,66667
Antoniy             6 27.09.18       7000       7875
Olesya              6 11.11.18       8000       7900
Ivan                1 03.04.19       8000 7916,66667

6 rows selected. 
*/



/* 1.3. Виконайте попереднє завдання, отримавши накопичувальні підсумки в кожній
підгрупі окремо. Використати аналітичну функцію на основі AVG, PARTITION BY, ORDER BY.

Для кожного рядка визначити середні витрати спортклубу на зарплату тренерів
на вказану поточну дату окремо для кожного залу.
*/

SELECT cName, gymNo, hireDate, sal,
    AVG(sal) OVER (PARTITION BY gymNo ORDER BY hireDate) avg_sal
FROM COACH;

/* Результат:

CNAME           GYMNO HIREDATE        SAL    AVG_SAL
---------- ---------- -------- ---------- ----------
Alexander           1 04.07.15       9000       9000
Ivan                1 03.04.19       8000       8500
Andrey              5 07.04.17       8000       8000
Philip              5 20.05.18       7500       7750
Antoniy             6 27.09.18       7000       7000
Olesya              6 11.11.18       8000       7500

6 rows selected. 
*/